app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def update
        todo = user.todos.find(params[:id]).update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def destroy
        todo = user.todos.find(params[:id]).destroy